#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.all: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0dcee13c71f063543]
aws_iam_role.role-launch-ec2: Refreshing state... [id=prod-role-launch-instance]
data.aws_availability_zones.all: Read complete after 0s [id=us-east-1]
aws_iam_instance_profile.ec2-instance-profile: Refreshing state... [id=prod-iam-instance-profile]
aws_subnet.private-subnet[3]: Refreshing state... [id=subnet-0897e77d270f6214b]
aws_subnet.private-subnet[4]: Refreshing state... [id=subnet-0ef79d34b13425a88]
aws_subnet.private-subnet[0]: Refreshing state... [id=subnet-015a7bdb7aa2ad0e7]
aws_subnet.private-subnet[2]: Refreshing state... [id=subnet-0f37ba5b6d495edfc]
aws_subnet.private-subnet[5]: Refreshing state... [id=subnet-048b788eb8474ab21]
aws_subnet.public-subnet[4]: Refreshing state... [id=subnet-0765a747d29bb6fe9]
aws_subnet.public-subnet[0]: Refreshing state... [id=subnet-0aa05051bfa7feef5]
aws_subnet.private-subnet[1]: Refreshing state... [id=subnet-060a1313ea73b34d1]
aws_subnet.public-subnet[5]: Refreshing state... [id=subnet-0e8a3f0b6eb3ded9f]
aws_security_group.sg: Refreshing state... [id=sg-0f84910f03ed7e1da]
aws_subnet.public-subnet[1]: Refreshing state... [id=subnet-044ba473937913edc]
aws_subnet.public-subnet[2]: Refreshing state... [id=subnet-072158ae7b7d1bdc6]
aws_internet_gateway.igw: Refreshing state... [id=igw-0af35376874190c30]
aws_subnet.public-subnet[3]: Refreshing state... [id=subnet-04a613d851d85233b]
aws_launch_configuration.alc: Refreshing state... [id=prod-remix-recipe-launch-configuration-20230208212119888800000001]
aws_route.public_subnets_igw[4]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[2]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[0]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[5]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[1]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[3]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_autoscaling_group.asg: Refreshing state... [id=prod-remix-recipe-auto-scaling-group-20230208204127058200000002]
aws_route_table_association.public_subnets_association[4]: Refreshing state... [id=rtbassoc-0754fe23725f6f60e]
aws_route_table_association.public_subnets_association[5]: Refreshing state... [id=rtbassoc-0d6532c379cc5eee7]
aws_elb.elb: Refreshing state... [id=prod-remix-recipe-load-balancer]
aws_route_table_association.public_subnets_association[1]: Refreshing state... [id=rtbassoc-03b4862c5531e112e]
aws_route_table_association.public_subnets_association[0]: Refreshing state... [id=rtbassoc-0e01d27c252c6cc27]
aws_route_table_association.public_subnets_association[2]: Refreshing state... [id=rtbassoc-0c92e5dadcc0edc86]
aws_route_table_association.public_subnets_association[3]: Refreshing state... [id=rtbassoc-0eade0005b29df706]
aws_autoscaling_attachment.asg_elb: Refreshing state... [id=prod-remix-recipe-auto-scaling-group-20230208204127058200000002-20230208211657867900000002]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_autoscaling_group.asg has been deleted
  - resource "aws_autoscaling_group" "asg" {
        id                        = "prod-remix-recipe-auto-scaling-group-20230208204127058200000002"
      - name                      = "prod-remix-recipe-auto-scaling-group-20230208204127058200000002" -> null
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_launch_configuration.alc has been deleted
  - resource "aws_launch_configuration" "alc" {
        id                          = "prod-remix-recipe-launch-configuration-20230208212119888800000001"
      - name                        = "prod-remix-recipe-launch-configuration-20230208212119888800000001" -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_elb will be created
  + resource "aws_autoscaling_attachment" "asg_elb" {
      + autoscaling_group_name = "prod-remix-recipe-auto-scaling-group"
      + elb                    = "prod-remix-recipe-load-balancer"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = "prod-remix-recipe-launch-configuration"
      + max_size                  = 10
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "prod-remix-recipe-auto-scaling-group"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-044ba473937913edc",
          + "subnet-04a613d851d85233b",
          + "subnet-072158ae7b7d1bdc6",
          + "subnet-0765a747d29bb6fe9",
          + "subnet-0aa05051bfa7feef5",
          + "subnet-0e8a3f0b6eb3ded9f",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "prod-remix-recipe-webserver"
        }
    }

  # aws_launch_configuration.alc will be created
  + resource "aws_launch_configuration" "alc" {
      + arn                         = (known after apply)
      + associate_public_ip_address = true
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + iam_instance_profile        = "prod-iam-instance-profile"
      + id                          = (known after apply)
      + image_id                    = "ami-0323c3dd2da7fb37d"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = "prod-remix-recipe-launch-configuration"
      + name_prefix                 = (known after apply)
      + security_groups             = [
          + "sg-0f84910f03ed7e1da",
        ]
      + user_data                   = "823a584249f7502b9f841b87232c6ca95e7daa76"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp2"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shubhamcommits, Action: `pull_request`*